import "./aboutUs.scss"

export default function AboutUs() {
    return (
        <div className="about-us" id="about-us">
            <h2>ЗА НАС</h2>
            <p>
                Добре дошли в света на Фитскуад, където Ви очакват незабравими преживявания. Нашите лагери са създадени
                с мисълта за активни и енергични хора, които искат да комбинират спорт, обучение и забавление
                в едно незабравимо приключение.
            </p>
            <p>
                В програмата на нашите лагери ще намерите разнообразие от спортни дейности. Нашите опитни треньори ще
                Ви помогнат да усъвършенствате уменията си и да се забавлявате, докато спортувате. Освен спортни активности,
                ние предлагаме и лекции, където ще научите полезни техники за здравословен начин на живот, хранене и спорт.
                За тези, които търсят вътрешен баланс и хармония, предлагаме йога и пилатес сесии, водени от сертифицирани
                инструктори. Тези практики са идеални за релаксация и подобряване на гъвкавостта и силата на тялото.
                За да се погрижите за духа си, организираме и дихателни практики, които ще ви помогнат да се
                освободите от стреса и да се почувствате обновени.
            </p>
            <p>
                Нашите лагери не са само за тренировки – ние знаем колко е важно да се забавлявате и да създавате спомени.
                Ето защо организираме разнообразни партита и социални събития, където можете да се отпуснете и да се
                запознаете с нови приятели. Нашите вечери включват музика, танци и много смях, гарантирайки, че ще се
                забавлявате на макс.
                В края на всеки ден ще се наслаждавате на незабравими емоции и чувства на удовлетворение от пълноценно
                прекараното време. Нашите лагери са идеалното място за тези, които искат да избягат от рутината и да се
                потопят в атмосфера на спорт, здраве и забавление.
            </p>
            <p className="last-paragraph">
                Заповядайте при нас и открийте какво означава истинско преживяване, съчетаващо физическа активност, вътрешен
                мир и социални контакти. Очакваме Ви с отворени обятия и обещаваме, че ще си тръгнете с нови приятели и
                спомени за цял живот. Присъединете се към нас и започнете своето приключение още днес!
            </p>
        </div>
    )
}